---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.LinearForce
source: html/941c202e-d8ce-3f71-2b02-f9948875db76.htm
---
# Autodesk.Revit.DB.SpecTypeId.LinearForce Property

Linear Force, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId LinearForce { get; }
```